Repository: Sunalamye/Naki
Catalog: command/Resources/Localizable.xcstrings
Source language: zh_hant
Languages: en, ja, ko, zh_hans

source: %@ ⚠️ 三麻無專用模型
en: %@ ⚠️ no dedicated Sanma model
ja: %@ ⚠️ 三麻専用モデルなし
ko: %@ ⚠️ 3인 마작 전용 모델 없음
zh_hans: %@ ⚠️ 三麻无专用模型

source: %@ 新增 %@
en: %1$@ added %2$@
ja: %1$@ に %2$@ を追加
ko: %1$@에 %2$@ 추가

source: %@ 秒
en: %@ s
ko: %@초

source: %@ 移除 %@
en: %1$@ removed %2$@
ja: %1$@ から %2$@ を削除
ko: %1$@에서 %2$@ 제거

source: %@・%lld 本場
en: %@・Honba %lld
ko: %@・%lld본장
zh_hans: %@・%lld 本场

source: %@（我）
en: %@ (me)
ja: %@（自分）
ko: %@ (나)

source: %@：與既有目錄 %@ 只差大小寫
en: %@: differs from existing directory %@ only by case
ja: %@：既存のフォルダ %@ と大文字小文字しか違いません
ko: %@: 기존 폴더 %@와 대소문자만 다름
zh_hans: %@：与既有目录 %@ 只差大小写

source: %lld 天
en: %lld days
ja: %lld 日
ko: %lld일

source: %lld 推薦
en: %lld recommendations
ja: おすすめ %lld 件
ko: 추천 %lld개
zh_hans: %lld 条推荐

source: %lld 本
en: %lld
ko: %lld개
zh_hans: %lld 根

source: %lld 次/分
en: %lld req/min
ja: %lld 回/分
ko: %lld회/분

source: %lld 點
en: %lld points
ja: %lld点
ko: %lld점
zh_hans: %lld 点

source: **安裝插件＝信任其作者。** 插件與遊戲跑在同一個 JS 環境裡，惡意插件可以用你的帳號送出任何遊戲動作、讀取頁面上任何資料（含 session token），Naki **無法阻止**。只裝你信任的插件。開關即時生效、免重新載入頁面。
en: **Installing a plugin = trusting its author.** Plugins run in the same JS environment as the game, so a malicious plugin can send any game action with your account and read any data on the page (including the session token), and Naki **cannot prevent it**. Only install plugins you trust. The switch takes effect immediately without reloading the page.
ja: **プラグインのインストール＝作者を信頼すること。** プラグインはゲームと同じ JS 環境で動作するため、悪意のあるプラグインはあなたのアカウントで任意のゲーム操作を送信し、ページ上のあらゆるデータ（session token を含む）を読み取れます。Naki には**防げません**。信頼できるプラグインだけをインストールしてください。スイッチは即座に反映され、ページの再読み込みは不要です。
ko: **플러그인 설치＝작성자를 신뢰한다는 뜻입니다.** 플러그인은 게임과 같은 JS 환경에서 실행되므로 악성 플러그인은 내 계정으로 어떤 게임 동작이든 보내고 페이지의 모든 데이터(session token 포함)를 읽을 수 있으며, Naki는 이를 **막을 수 없습니다**. 신뢰하는 플러그인만 설치하세요. 스위치는 즉시 적용되며 페이지를 새로고침할 필요가 없습니다.
zh_hans: **安装插件＝信任其作者。** 插件与游戏运行在同一个 JS 环境中，恶意插件可以用你的账号发送任何游戏操作、读取页面上的任何数据（包括 session token），Naki **无法阻止**。只安装你信任的插件。开关即时生效，无需重新加载页面。

source: AI 推薦
en: AI recommendation
ja: AI のおすすめ
ko: AI 추천
zh_hans: AI 推荐

source: AI 推薦模式
en: AI recommendation mode
ja: AI おすすめモード
ko: AI 추천 모드
zh_hans: AI 推荐模式

source: AI 推薦模式（此裝置不提供自動送出）
en: AI recommendation mode (auto-send is not available on this device)
ja: AI おすすめモード（このデバイスでは自動送信は利用できません）
ko: AI 추천 모드(이 기기에서는 자동 전송을 지원하지 않음)
zh_hans: AI 推荐模式（此设备不提供自动发送）

source: API Key（自行取得後貼上）
en: API Key (obtain it yourself and paste)
ja: API キー（各自で取得して貼り付け）
ko: API Key(직접 발급받아 붙여넣기)
zh_hans: API Key（自行获取后粘贴）

source: Bot 已建立 (Player %lld)
en: Bot created (Player %lld)
ja: Bot を作成しました (Player %lld)
ko: Bot 생성됨 (Player %lld)
zh_hans: Bot 已创建 (Player %lld)

source: Bot 已重新同步 (Player %lld)
en: Bot resynced (Player %lld)
ja: Bot を再同期しました (Player %lld)
ko: Bot 재동기화됨 (Player %lld)

source: Bot 會在遊戲開始時自動創建，通常不需要手動管理。
en: The bot is created automatically when a game starts; you usually don't need to manage it manually.
ja: Bot はゲーム開始時に自動で作成されるため、通常は手動で管理する必要はありません。
ko: Bot은 게임이 시작될 때 자동으로 생성되므로 보통 직접 관리할 필요가 없습니다.
zh_hans: Bot 会在游戏开始时自动创建，通常不需要手动管理。

source: Bot 管理
en: Bot Management
ko: Bot 관리

source: Bot 運行狀態
en: Bot status
ja: Bot の稼働状態
ko: Bot 실행 상태
zh_hans: Bot 运行状态

source: JavaScript 注入失敗
en: JavaScript injection failed
ja: JavaScript の注入に失敗
ko: JavaScript 주입 실패
zh_hans: JavaScript 注入失败

source: JavaScript 注入失敗：Naki 讀不到牌局，也送不出任何動作
en: JavaScript injection failed: Naki cannot read the game or send any action
ja: JavaScript の注入に失敗: Naki は対局を読み取れず、操作も送信できません
ko: JavaScript 주입 실패: Naki가 대국을 읽을 수 없고 어떤 동작도 보낼 수 없습니다
zh_hans: JavaScript 注入失败：Naki 读不到牌局，也发送不出任何动作

source: MCP Server 已停止
en: MCP Server stopped
ja: MCP Server を停止しました
ko: MCP Server 중지됨

source: MCP Server 已在運行
en: MCP Server is already running
ja: MCP Server は既に実行中です
ko: MCP Server가 이미 실행 중입니다
zh_hans: MCP Server 已在运行

source: MCP Server 狀態
en: MCP Server status
ja: MCP Server の状態
ko: MCP Server 상태
zh_hans: MCP Server 状态

source: MCP Server 運行中
en: MCP Server running
ja: MCP Server 稼働中
ko: MCP Server 실행 중
zh_hans: MCP Server 运行中

source: Sunalamye/naki-plugins 或 gist / plugin.json 網址
en: Sunalamye/naki-plugins or a gist / plugin.json URL
ja: Sunalamye/naki-plugins または gist / plugin.json の URL
ko: Sunalamye/naki-plugins 또는 gist / plugin.json URL
zh_hans: Sunalamye/naki-plugins 或 gist / plugin.json 网址

source: URL 格式不對
en: Invalid URL format
ja: URL の形式が正しくありません
ko: URL 형식이 올바르지 않음
zh_hans: URL 格式不对

source: URL 無法解析
en: Cannot parse the URL
ja: URL を解析できません
ko: URL을 해석할 수 없습니다
zh_hans: 无法解析 URL

source: WebSocket 連線狀態
en: WebSocket connection status
ja: WebSocket 接続状態
ko: WebSocket 연결 상태
zh_hans: WebSocket 连接状态

source: apiVersion %lld 不支援（只收 1）
en: apiVersion %lld is unsupported (only 1 is accepted)
ja: apiVersion %lld は非対応です（1 のみ）
ko: apiVersion %lld은(는) 지원되지 않음(1만 허용)
zh_hans: apiVersion %lld 不支持（只收 1）

source: entry 必須是單一 .js 檔名（字元集同 id）
en: entry must be a single .js filename (same character set as id)
ja: entry は単一の .js ファイル名である必要があります（文字種は id と同じ）
ko: entry는 단일 .js 파일 이름이어야 함(문자 집합은 id와 동일)
zh_hans: entry 必须是单一 .js 文件名（字符集同 id）

source: gist 沒有檔案
en: The gist has no files
ja: gist にファイルがありません
ko: gist에 파일이 없음
zh_hans: gist 没有文件

source: id 只允許 A-Z a-z 0-9 . _ -，且不得以 . 開頭或含 ..
en: id may only contain A-Z a-z 0-9 . _ - and must not start with . or contain ..
ja: id に使えるのは A-Z a-z 0-9 . _ - のみで、. で始めたり .. を含めたりできません
ko: id에는 A-Z a-z 0-9 . _ -만 쓸 수 있으며 .로 시작하거나 ..을 포함할 수 없음
zh_hans: id 只允许 A-Z a-z 0-9 . _ -，且不得以 . 开头或含 ..

source: id 為空
en: id is empty
ja: id が空です
ko: id가 비어 있음
zh_hans: id 为空

source: id 與目錄名不符：%@
en: id does not match directory name: %@
ja: id がフォルダ名と一致しません：%@
ko: id가 폴더 이름과 일치하지 않음: %@
zh_hans: id 与目录名不符：%@

source: id／entry／檔名不合法
en: Invalid id, entry, or filename
ja: id／entry／ファイル名が不正です
ko: id/entry/파일 이름이 잘못됨
zh_hans: id／entry／文件名不合法

source: manifest '%@' ≠ 目錄 '%@'
en: manifest '%@' ≠ directory '%@'
ja: manifest '%@' ≠ フォルダ '%@'
ko: manifest '%@' ≠ 폴더 '%@'
zh_hans: manifest '%@' ≠ 目录 '%@'

source: manifest 無效：%@
en: Invalid manifest: %@
ja: manifest が無効です：%@
ko: manifest가 잘못됨: %@
zh_hans: manifest 无效：%@

source: plugin.json 缺欄位或格式錯
en: plugin.json is missing fields or malformed
ja: plugin.json に必須項目がないか形式が不正です
ko: plugin.json에 필드가 없거나 형식이 잘못됨
zh_hans: plugin.json 缺字段或格式错

source: plugin.json 解不開
en: plugin.json could not be parsed
ja: plugin.json を解析できません
ko: plugin.json을 해석할 수 없음
zh_hans: plugin.json 解析失败

source: repo 裡沒有有效插件
en: No valid plugin in the repo
ja: リポジトリに有効なプラグインがありません
ko: 저장소에 유효한 플러그인이 없음
zh_hans: repo 里没有有效插件

source: settings.%@ schema 無效
en: settings.%@ schema is invalid
ja: settings.%@ の schema が無効です
ko: settings.%@ schema가 잘못됨
zh_hans: settings.%@ schema 无效

source: settings.%@ schema 無效（type 或 default 不合）
en: settings.%@ schema is invalid (type or default mismatch)
ja: settings.%@ の schema が無効です（type か default が不一致）
ko: settings.%@ schema가 잘못됨(type 또는 default 불일치)
zh_hans: settings.%@ schema 无效（type 或 default 不合）

source: ——可用模型欄旁的箭頭直接選
en: — pick one with the arrow next to the model field
ja: ——モデル欄の横の矢印から選べます
ko: ——모델 입력란 옆의 화살표로 바로 선택하세요
zh_hans: ——可直接用模型栏旁的箭头选择

source: ⚠️ 安裝＝信任作者。插件能用你的帳號送動作、讀頁面上任何資料，Naki 無法阻止。
en: ⚠️ Installing = trusting the author. A plugin can send actions with your account and read any data on the page, and Naki cannot prevent that.
ja: ⚠️ インストール＝作者を信頼することです。プラグインはあなたのアカウントで操作を送信し、ページ上のあらゆるデータを読み取れますが、Naki には防げません。
ko: ⚠️ 설치＝작성자를 신뢰한다는 뜻입니다. 플러그인은 내 계정으로 동작을 보내고 페이지의 모든 데이터를 읽을 수 있으며, Naki는 이를 막을 수 없습니다.
zh_hans: ⚠️ 安装＝信任作者。插件能用你的账号发送操作、读取页面上的任何数据，Naki 无法阻止。

source: ⚠️ 更新＝執行作者新寫的程式碼，等同重新信任。
en: ⚠️ Updating = running code the author has just written, equivalent to trusting them again.
ja: ⚠️ 更新＝作者が新しく書いたコードを実行することであり、再度信頼することと同じです。
ko: ⚠️ 업데이트＝작성자가 새로 쓴 코드를 실행하는 것이며, 다시 신뢰하는 것과 같습니다.
zh_hans: ⚠️ 更新＝执行作者新写的代码，等同于重新信任。

source: ❌ %lld 次都未被接受，停止續局
en: ❌ Rejected %lld times; rematch stopped
ja: ❌ %lld 回とも受理されず、次局を停止しました
ko: ❌ %lld회 모두 거부되어 다음 대국을 중지함
zh_hans: ❌ %lld 次都未被接受，停止续局

source: 一筒
en: 1 Pin
ko: 1통

source: 一索
en: 1 Sou
ko: 1삭

source: 一萬
en: 1 Man
ko: 1만
zh_hans: 一万

source: 七筒
en: 7 Pin
ko: 7통

source: 七索
en: 7 Sou
ko: 7삭

source: 七萬
en: 7 Man
ko: 7만
zh_hans: 七万

source: 三人麻將
en: Sanma (3P)
ja: 三人麻雀
ko: 3인 마작
zh_hans: 三人麻将

source: 三筒
en: 3 Pin
ko: 3통

source: 三索
en: 3 Sou
ko: 3삭

source: 三萬
en: 3 Man
ko: 3만
zh_hans: 三万

source: Akagi 三麻・default strength
en: Akagi 3P・default strength
ko: Akagi 3인 마작・default strength

source: 三麻提醒：本地有 Akagi 三麻（default strength，模仿天鳳人類）接手，雲端啟用時雲端優先；側欄的決策來源會如實顯示。
en: 3P note: the local Akagi 3P engine (default strength, imitates Tenhou players) takes over, and the cloud has priority when enabled; the sidebar shows the real decision source.
ja: 三麻の注意：ローカルの Akagi 三麻（default strength、天鳳プレイヤーを模倣）が引き継ぎ、クラウド有効時はクラウド優先です。サイドバーに実際の判断元が表示されます。
ko: 3인 마작 안내: 로컬 Akagi 3인 마작(default strength, 텐호 플레이어 모방)이 이어받으며, 클라우드가 켜져 있으면 클라우드가 우선입니다. 사이드바에 실제 결정 출처가 표시됩니다.
zh_hans: 三麻提醒：本地有 Akagi 三麻（default strength，模仿天凤玩家）接手，云端启用时云端优先；侧栏的决策来源会如实显示。

source: 雲端失敗——正在用本地 Akagi 三麻（連續 %lld 手）
en: Cloud failed — using the local Akagi 3P engine (%lld in a row)
ja: クラウド失敗——ローカルの Akagi 三麻を使用中（%lld 手連続）
ko: 클라우드 실패 — 로컬 Akagi 3인 마작 사용 중 (%lld수 연속)
zh_hans: 云端失败——正在使用本地 Akagi 三麻（连续 %lld 手）

source: 三麻尚無推薦：本地 Akagi 三麻引擎在下一個決策點才會產出。
en: No 3P recommendation yet: the local Akagi 3P engine produces one at the next decision point.
ja: 三麻の推奨はまだありません：ローカルの Akagi 三麻エンジンは次の決定点で推奨を出します。
ko: 3인 마작 추천이 아직 없습니다: 로컬 Akagi 3인 마작 엔진이 다음 결정 시점에 추천을 만듭니다.
zh_hans: 三麻暂无推荐：本地 Akagi 三麻引擎会在下一个决策点给出推荐。

source: 選了三麻但沒有三麻引擎，不排隊——排進去也不會出手。
en: 3P selected but no 3P engine is available; not queuing, since it would not play.
ja: 三麻が選択されていますが三麻エンジンがないため、キューに入りません。入っても打てません。
ko: 3인 마작을 선택했지만 3인 마작 엔진이 없어 대기열에 넣지 않습니다. 들어가도 패를 치지 못합니다.
zh_hans: 选了三麻但没有三麻引擎，不排队——排进去也不会出手。

source: 三麻模型（空＝伺服器預設）
en: Sanma model (empty = server default)
ja: 三麻モデル（空欄＝サーバーの既定値）
ko: 3인 마작 모델(비워두면 서버 기본값)
zh_hans: 三麻模型（留空＝服务器默认）

source: 上方的「啟用雲端推論」開關
en: the "Enable cloud inference" switch above
ja: 上の「クラウド推論を有効にする」スイッチ
ko: 위의 "클라우드 추론 사용" 스위치
zh_hans: 上方的“启用云端推理”开关

source: 下一局（或重連）解析成功就會自動消失；持續出現代表雀魂改了協定欄位。
en: This disappears automatically once the next round (or a reconnect) parses successfully; if it keeps appearing, Mahjong Soul has changed protocol fields.
ja: 次の局（または再接続）で解析に成功すると自動的に消えます。表示され続ける場合は、雀魂がプロトコルのフィールドを変更したことを意味します。
ko: 다음 국(또는 재연결)에서 해석에 성공하면 자동으로 사라집니다. 계속 표시된다면 작혼이 프로토콜 필드를 변경했다는 뜻입니다.
zh_hans: 下一局（或重连）解析成功后会自动消失；若持续出现，说明雀魂更改了协议字段。

source: 不可用
en: Unavailable
ja: 利用不可
ko: 사용 불가

source: 中
en: Red
ko: 중

source: 之後可以在進階設定裡改，或取消固定。
en: You can change this later in Advanced Settings, or unpin it.
ja: あとで詳細設定から変更または固定の解除ができます。
ko: 나중에 고급 설정에서 변경하거나 고정을 해제할 수 있습니다.
zh_hans: 之后可以在高级设置里修改，或取消固定。

source: 九種九牌
en: Nine Terminals
ko: 구종구패
zh_hans: 九种九牌

source: 九筒
en: 9 Pin
ko: 9통

source: 九索
en: 9 Sou
ko: 9삭

source: 九萬
en: 9 Man
ko: 9만
zh_hans: 九万

source: 二筒
en: 2 Pin
ko: 2통

source: 二索
en: 2 Sou
ko: 2삭

source: 二萬
en: 2 Man
ko: 2만
zh_hans: 二万

source: 五筒
en: 5 Pin
ko: 5통

source: 五索
en: 5 Sou
ko: 5삭

source: 五萬
en: 5 Man
ko: 5만
zh_hans: 五万

source: 人數
en: Players
ja: 人数
ko: 인원
zh_hans: 人数

source: 今日用量
en: Today's usage
ja: 本日の使用量
ko: 오늘 사용량

source: 以後都用這個伺服器，不要再問
en: Always use this server and don't ask again
ja: 今後はこのサーバーを使い、再度確認しない
ko: 앞으로 이 서버를 사용하고 다시 묻지 않기
zh_hans: 以后都使用这个服务器，不再询问

source: 伺服器
en: Server
ja: サーバー
ko: 서버
zh_hans: 服务器

source: 伺服器 %@（未填 key，略過模型查詢）
en: Server %@ (no key entered, skipped model query)
ja: サーバー %@（キー未入力のためモデル照会をスキップ）
ko: 서버 %@(키가 없어 모델 조회를 건너뜀)
zh_hans: 服务器 %@（未填写 key，跳过模型查询）

source: 伺服器 %@；可用模型：%@
en: Server %1$@; available models: %2$@
ja: サーバー %1$@、利用可能なモデル: %2$@
ko: 서버 %1$@; 사용 가능한 모델: %2$@
zh_hans: 服务器 %1$@；可用模型：%2$@

source: 伺服器 URL
en: Server URL
ja: サーバー URL
ko: 서버 URL
zh_hans: 服务器 URL

source: 伺服器 URL 無法解析
en: Cannot parse the server URL
ja: サーバー URL を解析できません
ko: 서버 URL을 해석할 수 없습니다
zh_hans: 无法解析服务器 URL

source: 伺服器目前授權動作
en: Actions currently authorized by the server
ja: サーバーが現在許可している操作
ko: 서버가 현재 허용한 동작
zh_hans: 服务器当前授权的动作

source: 伺服器預設（清空）
en: Server default (clear)
ja: サーバーの既定値（クリア）
ko: 서버 기본값(비우기)
zh_hans: 服务器默认（清空）

source: 使用中
en: In use
ko: 사용 중

source: 供託
en: Riichi sticks
ko: 공탁
zh_hans: 供托

source: 依帳號段位挑一間打得了的房：「最低」對手最弱、掉段風險最小；「最高」點數效率高但打不好會掉段。
en: Picks a room your account rank can play in: "Lowest" has the weakest opponents and the lowest risk of losing rank; "Highest" is more point-efficient but you may lose rank if you play poorly.
ja: アカウントの段位で入れる部屋を選びます。「最低」は対戦相手が最も弱く降段のリスクが最小、「最高」はポイント効率が高い一方、打ち損じると降段します。
ko: 계정 단위로 입장 가능한 방을 고릅니다. "최저"는 상대가 가장 약하고 강등 위험이 가장 낮으며, "최고"는 점수 효율이 높지만 못 두면 강등됩니다.
zh_hans: 按账号段位挑选一间打得了的房间：“最低”对手最弱、掉段风险最小；“最高”点数效率高，但打不好会掉段。

source: 信任
en: Trust
ja: 信頼
ko: 신뢰

source: 信任邊界與 L3 權限
en: Trust Boundary and L3 Permission
ja: 信頼の境界と L3 権限
ko: 신뢰 경계와 L3 권한
zh_hans: 信任边界与 L3 权限

source: 停止
en: Stop
ko: 중지

source: 允許插件送出遊戲動作（L3）
en: Allow plugins to send game actions (L3)
ja: プラグインによるゲーム操作の送信を許可（L3）
ko: 플러그인의 게임 동작 전송 허용(L3)
zh_hans: 允许插件发送游戏操作（L3）

source: 允許插件送出遊戲動作？
en: Allow plugins to send game actions?
ja: プラグインによるゲーム操作の送信を許可しますか？
ko: 플러그인의 게임 동작 전송을 허용할까요?
zh_hans: 允许插件发送游戏操作？

source: 先按「測試連線」取得模型清單
en: Click "Test Connection" first to get the model list
ja: 先に「接続テスト」を押してモデル一覧を取得してください
ko: 먼저 "연결 테스트"를 눌러 모델 목록을 가져오세요
zh_hans: 请先点击“测试连接”获取模型列表

source: 全不選
en: Deselect All
ja: すべて選択解除
ko: 모두 선택 해제
zh_hans: 全不选

source: 全自動
en: Full Auto
ko: 완전 자동
zh_hans: 全自动

source: 全自動續局已停止：%@
en: Full-auto rematch stopped: %@
ja: 全自動の次局開始を停止しました：%@
ko: 완전 자동 다음 대국이 중지됨: %@
zh_hans: 全自动续局已停止：%@

source: 全選
en: Select All
ja: すべて選択
ko: 모두 선택
zh_hans: 全选

source: 全部
en: All
ja: すべて
ko: 전체

source: 八筒
en: 8 Pin
ko: 8통

source: 八索
en: 8 Sou
ko: 8삭

source: 八萬
en: 8 Man
ko: 8만
zh_hans: 八万

source: 六筒
en: 6 Pin
ko: 6통

source: 六索
en: 6 Sou
ko: 6삭

source: 六萬
en: 6 Man
ko: 6만
zh_hans: 六万

source: 其他選項
en: Other options
ja: その他の候補
ko: 다른 선택지
zh_hans: 其他选项

source: 分頁
en: Tabs
ja: タブ
ko: 탭
zh_hans: 标签页

source: 切換到「推薦」或「自動」可恢復
en: Switch to Recommend or Auto to restore
ja: 「おすすめ」または「自動」に切り替えると復元できます
ko: '추천' 또는 '자동'으로 전환하면 복원됩니다
zh_hans: 切换到“推荐”或“自动”可恢复

source: 刪除 Bot
en: Delete Bot
ja: Bot を削除
ko: Bot 삭제
zh_hans: 删除 Bot

source: 刪除失敗：%@
en: Delete failed: %@
ja: 削除に失敗しました：%@
ko: 삭제 실패: %@
zh_hans: 删除失败：%@

source: 到期時間
en: Expires
ja: 有効期限
ko: 만료 시간
zh_hans: 到期时间

source: 前往下載
en: Download
ja: ダウンロードへ
ko: 다운로드로 이동
zh_hans: 前往下载

source: 剩餘
en: Remaining
ja: 残り
ko: 남은 기간
zh_hans: 剩余

source: 加載失敗: %@
en: Load failed: %@
ja: 読み込み失敗: %@
ko: 로드 실패: %@
zh_hans: 加载失败: %@

source: 北
en: North
ko: 북

source: 北%lld局
en: North %lld
ko: 북%lld국

source: 北家
en: North
ko: 북가

source: 匯入失敗：%@
en: Import failed: %@
ja: インポートに失敗: %@
ko: 가져오기 실패: %@
zh_hans: 导入失败：%@

source: 南
en: South
ko: 남

source: 南%lld局
en: South %lld
ko: 남%lld국

source: 南家
en: South
ko: 남가

source: 即時決策
en: Live decision
ja: リアルタイム判断
ko: 실시간 판단
zh_hans: 实时决策

source: 原始碼（%@）
en: Source (%@)
ja: ソースコード（%@）
ko: 소스 코드(%@)
zh_hans: 源代码（%@）

source: 取消
en: Cancel
ja: キャンセル
ko: 취소

source: 只接受 HTTPS
en: HTTPS only
ja: HTTPS のみ対応
ko: HTTPS만 허용

source: 只會排你自己點過、而且已經打過一場的場次；沒有的話會停下來並在紀錄裡說明。
en: Only game types you have clicked yourself and have already played once are queued; if there are none, it stops and explains in the log.
ja: 自分でクリックしたことがあり、すでに一度対局した対局種別のみマッチングされます。該当がない場合は停止し、ログに理由を記録します。
ko: 직접 눌러 본 적이 있고 이미 한 판 이상 둔 대국 종류만 대기열에 넣습니다. 해당하는 것이 없으면 멈추고 로그에 설명을 남깁니다.
zh_hans: 只会排你自己点过、并且已经打过一场的场次；没有的话会停下来并在记录里说明。

source: 可用
en: Available
ja: 利用可能
ko: 사용 가능

source: 吃
en: Chi
ja: チー
ko: 치

source: 吃①
en: Chi ①
ja: チー①
ko: 치 ①

source: 吃②
en: Chi ②
ja: チー②
ko: 치 ②

source: 吃③
en: Chi ③
ja: チー③
ko: 치 ③

source: 各服的帳號不互通
en: Accounts are not shared between servers
ja: サーバー間でアカウントは共通ではありません
ko: 서버 간에 계정이 호환되지 않습니다
zh_hans: 各服务器的账号互不通用

source: 和
en: Win
ja: 和了
ko: 화료

source: 和牌送不出去，請手動操作
en: Could not send the win; please act manually
ja: 和了を送信できません。手動で操作してください
ko: 화료를 보낼 수 없습니다. 직접 조작해 주세요
zh_hans: 和牌发不出去，请手动操作

source: 啟動
en: Start
ja: 起動
ko: 시작
zh_hans: 启动

source: 啟動時不再詢問
en: Don't ask at launch
ja: 起動時に確認しない
ko: 시작할 때 묻지 않기
zh_hans: 启动时不再询问

source: 啟用
en: Enabled
ja: 有効
ko: 사용
zh_hans: 启用

source: 啟用後改設定即時套用（熱重載）。
en: After the plugin is enabled, setting changes apply immediately (hot reload).
ja: 有効にすると、設定の変更が即座に反映されます（ホットリロード）。
ko: 사용하면 설정을 바꾸는 즉시 적용됩니다(핫 리로드).
zh_hans: 启用后修改设置会立即生效（热重载）。

source: 啟用後，每個決策點會把**本局至今的對局事件**（含自家手牌）上傳到下方伺服器換取決策；伺服器失敗時自動退回內建本地模型，對局不會停擺。API key 存在 Keychain，不會出現在 log 或設定檔。
en: When enabled, at each decision point **the game events so far in this round (including your own hand)** are uploaded to the server below to get a decision. If the server fails, the app falls back to the built-in local model automatically, so the game never stalls. The API key is stored in the Keychain and never appears in logs or settings files.
ja: 有効にすると、各判断の場面で**この局のここまでの対局イベント**（自分の手牌を含む）を下記のサーバーにアップロードして判断を取得します。サーバーが失敗した場合は自動的に内蔵のローカルモデルに戻るため、対局が止まることはありません。API キーは Keychain に保存され、ログや設定ファイルには現れません。
ko: 사용하면 각 판단 시점마다 **이번 국의 지금까지 대국 이벤트**(내 손패 포함)를 아래 서버에 업로드해 판단을 받아옵니다. 서버가 실패하면 자동으로 내장 로컬 모델로 돌아가므로 대국이 멈추지 않습니다. API 키는 Keychain에 저장되며 로그나 설정 파일에는 나타나지 않습니다.
zh_hans: 启用后，每个决策点会把**本局至今的对局事件**（含自家手牌）上传到下方服务器以换取决策；服务器失败时自动退回内置本地模型，对局不会停摆。API key 存放在 Keychain，不会出现在日志或设置文件中。

source: 啟用雲端推論
en: Enable cloud inference
ja: クラウド推論を有効にする
ko: 클라우드 추론 사용
zh_hans: 启用云端推理

source: 四人麻將
en: Yonma (4P)
ja: 四人麻雀
ko: 4인 마작
zh_hans: 四人麻将

source: 四筒
en: 4 Pin
ko: 4통

source: 四索
en: 4 Sou
ko: 4삭

source: 四萬
en: 4 Man
ko: 4만
zh_hans: 四万

source: 四麻模型（空＝伺服器預設）
en: Yonma model (empty = server default)
ja: 四麻モデル（空欄＝サーバーの既定値）
ko: 4인 마작 모델(비워두면 서버 기본값)
zh_hans: 四麻模型（留空＝服务器默认）

source: 國服
en: CN Server
ja: 中国サーバー
ko: 중국 서버
zh_hans: 国服

source: 國際服
en: International Server
ja: 国際サーバー
ko: 국제 서버
zh_hans: 国际服

source: 基準延遲
en: Base delay
ja: 基準遅延
ko: 기준 지연
zh_hans: 基准延迟

source: 填入 %@
en: Fill in %@
ja: %@ を入力
ko: %@ 입력

source: 填入 API Key 後會自動查詢方案與今日用量。
en: Enter an API key to automatically look up the plan and today's usage.
ja: API キーを入力すると、プランと本日の使用量が自動的に取得されます。
ko: API 키를 입력하면 요금제와 오늘 사용량을 자동으로 조회합니다.
zh_hans: 填入 API Key 后会自动查询方案与今日用量。

source: 大廳連線探針一直不通，放棄續局
en: Lobby probe never succeeded; rematch abandoned
ja: ロビー接続の確認が通らないため、次局を中止しました
ko: 로비 연결 확인이 계속 실패해 다음 대국을 포기함
zh_hans: 大厅连接探针一直不通，放弃续局

source: 失敗：%@
en: Failed: %@
ko: 실패: %@
zh_hans: 失败：%@

source: 安裝失敗：%@
en: Install failed: %@
ja: インストールに失敗しました：%@
ko: 설치 실패: %@
zh_hans: 安装失败：%@

source: 完成
en: Done
ja: 完了
ko: 완료

source: 寶牌指示牌
en: Dora indicators
ja: ドラ表示牌
ko: 도라 표시패
zh_hans: 宝牌指示牌

source: 對局結束後會自動排下一場，直到你切走模式。
en: The next game is queued automatically after each game ends, until you switch away from this mode.
ja: 対局が終わると次の対局が自動的にマッチングされます。モードを切り替えるまで続きます。
ko: 대국이 끝나면 다음 대국을 자동으로 대기열에 넣으며, 다른 모드로 바꿀 때까지 계속됩니다.
zh_hans: 对局结束后会自动排下一场，直到你切换到其他模式。

source: 對局資料送往 %@
en: Game data is sent to %@
ja: 対局データを %@ に送信中
ko: 대국 데이터를 %@(으)로 전송 중
zh_hans: 对局数据发送至 %@

source: 對每個已裝插件重抓來源，比對內容有沒有變
en: Re-fetch the source of every installed plugin and compare whether the content changed
ja: インストール済みの各プラグインのソースを再取得し、内容が変わっているか比較します
ko: 설치된 각 플러그인의 소스를 다시 가져와 내용이 바뀌었는지 비교합니다
zh_hans: 对每个已安装插件重新抓取来源，比对内容是否有变化

source: 尚未檢查目前遊戲頁面
en: The current game page has not been checked yet
ja: 現在のゲームページはまだ確認されていません
ko: 현재 게임 페이지를 아직 확인하지 않았습니다
zh_hans: 尚未检查当前游戏页面

source: 局況
en: Round
ja: 局の状況
ko: 국 상황
zh_hans: 局况

source: 展開後顯示四家點數、寶牌與模型來源
en: Expand to show all players' scores, dora and model source
ja: 展開すると各家の点数、ドラ、モデルの情報源を表示します
ko: 펼치면 각 플레이어의 점수, 도라, 모델 출처를 표시합니다
zh_hans: 展开后显示四家点数、宝牌与模型来源

source: 已停止
en: Stopped
ja: 停止中
ko: 중지됨

source: 已固定為 %@，啟動時直接進入。關掉這個開關就會恢復每次詢問。
en: Pinned to %@; the app enters it directly at launch. Turn this off to be asked every time again.
ja: %@ に固定されており、起動時にそのまま入ります。このスイッチをオフにすると毎回確認するようになります。
ko: %@(으)로 고정되어 시작할 때 바로 입장합니다. 이 스위치를 끄면 매번 다시 묻습니다.
zh_hans: 已固定为 %@，启动时直接进入。关闭此开关即可恢复每次询问。

source: 已安裝（%lld）
en: Installed (%lld)
ja: インストール済み（%lld）
ko: 설치됨(%lld)
zh_hans: 已安装（%lld）

source: 已展開
en: Expanded
ja: 展開中
ko: 펼침
zh_hans: 已展开

source: 已引入 %lld/%lld 個插件。在上面清單啟用（熱插拔，免重載）。
en: Imported %1$lld/%2$lld plugin(s). Enable them in the list above (hot-swap, no reload needed).
ja: %2$lld 個中 %1$lld 個のプラグインを取り込みました。上の一覧で有効にしてください（ホットスワップ、再読み込み不要）。
ko: 플러그인 %2$lld개 중 %1$lld개를 가져왔습니다. 위 목록에서 사용으로 바꾸세요(핫스왑, 새로고침 불필요).
zh_hans: 已引入 %1$lld/%2$lld 个插件。在上面的列表中启用（热插拔，无需重载）。

source: 已收合
en: Collapsed
ja: 折りたたみ中
ko: 접힘
zh_hans: 已收起

source: 已斷開連線
en: Disconnected
ja: 切断されました
ko: 연결 끊김
zh_hans: 已断开连接

source: 已是最新版本
en: You're up to date
ja: 最新バージョンです
ko: 최신 버전입니다

source: 已設定・未使用
en: Configured, not in use
ja: 設定済み・未使用
ko: 설정됨・사용 안 함
zh_hans: 已设置・未使用

source: 已載入，等待 WebSocket 連接...
en: Loaded, waiting for WebSocket connection...
ja: 読み込み完了。WebSocket の接続を待っています...
ko: 로드됨, WebSocket 연결 대기 중...
zh_hans: 已加载，等待 WebSocket 连接...

source: 已連接
en: Connected
ja: 接続済み
ko: 연결됨
zh_hans: 已连接

source: 已連線
en: Connected
ja: 接続済み
ko: 연결됨
zh_hans: 已连接

source: 已連線到雀魂伺服器
en: Connected to Mahjong Soul server
ja: 雀魂サーバーに接続しました
ko: 작혼 서버에 연결됨
zh_hans: 已连接到雀魂服务器

source: 已過期
en: Expired
ja: 期限切れ
ko: 만료됨
zh_hans: 已过期

source: 已選擇
en: Selected
ja: 選択済み
ko: 선택됨
zh_hans: 已选择

source: 已隱藏
en: Hidden
ja: 非表示
ko: 숨겨짐
zh_hans: 已隐藏

source: 已顯示
en: Shown
ja: 表示中
ko: 표시됨
zh_hans: 已显示

source: 引入選中的（%lld）
en: Import Selected (%lld)
ja: 選択したものを取り込む（%lld）
ko: 선택 항목 가져오기(%lld)
zh_hans: 引入选中的（%lld）

source: 引用檔案跨來源（不允許）：%@
en: Referenced file is cross-origin (not allowed): %@
ja: 参照ファイルがクロスオリジンです（許可されていません）：%@
ko: 참조 파일이 교차 출처임(허용되지 않음): %@
zh_hans: 引用文件跨来源（不允许）：%@

source: 強制斷線重連，伺服器會重新發送遊戲狀態重建 Bot
en: Force a reconnect; the server resends the game state to rebuild the bot
ja: 強制的に再接続すると、サーバーがゲーム状態を再送して Bot を再構築します
ko: 강제로 연결을 끊고 다시 연결하면 서버가 게임 상태를 다시 보내 Bot을 재생성합니다
zh_hans: 强制断线重连，服务器会重新发送游戏状态以重建 Bot

source: 待機
en: Standby
ja: 待機中
ko: 대기 중
zh_hans: 待机

source: 從伺服器清單選擇
en: Choose from the server list
ja: サーバーの一覧から選択
ko: 서버 목록에서 선택
zh_hans: 从服务器列表选择

source: 從來源加入…
en: Add from Source…
ja: ソースから追加…
ko: 소스에서 추가…
zh_hans: 从来源添加…

source: 從來源加入（GitHub repo / gist / URL）
en: Add from Source (GitHub repo / gist / URL)
ja: ソースから追加（GitHub repo / gist / URL）
ko: 소스에서 추가(GitHub repo / gist / URL)
zh_hans: 从来源添加（GitHub repo / gist / URL）

source: 我的座位
en: My seat
ja: 自分の席
ko: 내 자리

source: 房間
en: Room
ja: 部屋
ko: 방
zh_hans: 房间

source: 打
en: Discard
ko: 버리기

source: 找不到 entry：%@
en: entry not found: %@
ja: entry が見つかりません：%@
ko: entry를 찾을 수 없음: %@

source: 找不到 plugin.json
en: plugin.json not found
ja: plugin.json が見つかりません
ko: plugin.json을 찾을 수 없음

source: 找不到插件目錄
en: Plugins directory not found
ja: プラグインフォルダが見つかりません
ko: 플러그인 폴더를 찾을 수 없음
zh_hans: 找不到插件目录

source: 抓取
en: Fetch
ja: 取得
ko: 가져오기

source: 抓取中…
en: Fetching…
ja: 取得中…
ko: 가져오는 중…

source: 抓取失敗：%@
en: Fetch failed: %@
ja: 取得に失敗しました：%@
ko: 가져오기 실패: %@
zh_hans: 抓取失败：%@

source: 拔北
en: Kita
ja: 北抜き
ko: 북 빼기

source: 推薦
en: Recommend
ja: おすすめ
ko: 추천
zh_hans: 推荐

source: 推薦顯示已關閉
en: Recommendations are hidden
ja: おすすめの表示はオフです
ko: 추천 표시가 꺼져 있습니다
zh_hans: 推荐显示已关闭

source: 推論位置
en: Inference location
ja: 推論の実行場所
ko: 추론 위치
zh_hans: 推理位置

source: 插件
en: Plugins
ja: プラグイン
ko: 플러그인

source: 插件 Log（即時）
en: Plugin Log (Live)
ja: プラグインログ（リアルタイム）
ko: 플러그인 로그(실시간)
zh_hans: 插件日志（实时）

source: 插件將能用你的帳號送出 Liqi request、改寫收到的封包。只在測試帳號、且你信任插件時開。
en: Plugins will be able to send Liqi requests with your account and rewrite received packets. Turn this on only for a test account and plugins you trust.
ja: プラグインがあなたのアカウントで Liqi request を送信し、受信パケットを書き換えられるようになります。テスト用アカウントで、信頼できるプラグインの場合のみオンにしてください。
ko: 플러그인이 내 계정으로 Liqi request를 보내고 수신한 패킷을 변경할 수 있게 됩니다. 테스트 계정이고 플러그인을 신뢰할 때만 켜세요.
zh_hans: 插件将能用你的账号发送 Liqi request、改写收到的封包。仅在测试账号且你信任插件时开启。
